# wsEditBeginN

## Description
Begin workspace edit. Use the other wsEdit* calls and must end with a call to wsEditEnd.

```pascal
PROCEDURE wsEditBeginN(
				companyName                : STRING;
				companyToolSetIconFilePath : STRING);
```

```python
def vs.wsEditBeginN(companyName, companyToolSetIconFilePath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|companyName|STRING|   |
|companyToolSetIconFilePath|STRING|   |

## Version
Availability: from Vectorworks 2021

## Category
* Workspaces